modules/Hotel/Controllers/HotelController.php

select * from `location_category` where `status` = 'publish' and `location_category`.`deleted_at` is null
---
    public function detail(Request $request, $slug)
    {
        $row = $this->hotelClass::where('slug', $slug)->with(['location', 'translation', 'hasWishList'])->first();;
        if (empty($row) or !$row->hasPermissionDetailView()) {
            return redirect('/');
        }
        $translation = $row->translate();
        $relatedQuery = $row->getRelated();
        $hotel_related = $relatedQuery ? $relatedQuery->take(4)->get() : [];
        $review_list = $row->getReviewList();
        $data = [
            'row'          => $row,
            'translation'       => $translation,
            'hotel_related' => $hotel_related,
            'location_category' => $this->locationCategoryClass::where("status", "publish")->with('location_category_translations')->get(),